blog/2022/physical-labour.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 17:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>学习粉墙</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">学习粉墙</h1>
</header><p>
今天是帮助父亲干活儿的第三天，干完活就没有精力继续学习了，因为特别累，无法集中注意力。
</p>

<p>
干的活属于室内装修，方言称「刮大白」，就是在墙上涂上白色涂料。手拿着板状工具，从已经搅拌好涂料的桶中，撅出一块来，放到墙上，再用工具顺平，要求是平整，没有突出凹陷。
</p>

<p>
我干这个已经四年了，每年寒假都会帮着父亲干一些。前几年干的时候，还不知道怎么用劲儿，手还不够灵活，刮出来的墙面总是深浅不一。和父亲的刮出来的差距甚远。今天父亲手把手又教我一次，发现自己已经掌握一些技巧了——刚开始学习的时候以快为主，先在面前手臂可及的范围内将涂料抹满，再刮去突出的部分，使得墙面平整。
</p>

<p>
父亲对我很严厉，我干活很慢，这是长久以来已经养成的习惯。所以，父亲唠叨很多，我又害怕他打我，也就更加小心翼翼。我被父亲打怕了，干活的时候会想象不知道哪一刻，头会被敲一下、屁股会挨上一脚。
</p>

<p>
我很着急，因为找工作需要的知识还没学习完毕。所以，我不想干活，它对我来说是一份煎熬。但是，我换一种角度看待它。
</p>

<p>
粉墙不是我所喜欢的，但这是我必须完成的，因为为了生活必须做到，如果不干就没有饭吃。况且，在找工作的时候，就算我真的找到前端工程师工作，工作内容就一定是我所喜欢的吗？如果不是，我是不是就要辞职另找一份呢？
</p>

<p>
不是的，即便工作内容并不为我喜欢，我也要尽职尽责，把我应该做的，以及可以做的都做到。工作就是创造价值，无论是为了自己还是为了别人。
</p>

<p>
刮大白和做前端都是反馈及时的事情，前者一眼就能看到，后者根据输出可以看到。这样的好处是可以很快地发现问题并解决。</p>
</div>
</body>
</html>